ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_gpio.c
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPIO(HT_GPIOx));

  GPIO_CK_ON();
  if ((HT_GPIOx->LOCKR >> 16) == 0)
    result = FALSE;
  else
    result = TRUE;
  GPIO_CK_OFF();
  return result;
}

/*********************************************************************************************************//**
 * @brief Get the lock state of specified GPIO port pin.
 * @param HT_GPIOx: where HT_GPIOx is the selected GPIO from the GPIO peripherals.
 * @param GPIO_PIN_n: This parameter can be GPIO_PIN_x.
 * @retval TRUE or FALSE
 ************************************************************************************************************/
bool GPIO_IsPinLocked(HT_GPIO_TypeDef* HT_GPIOx, u16 GPIO_PIN_n)
{
  bool result;
  GPIO_CK_ST;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPIO(HT_GPIOx));

  GPIO_CK_ON();
  if ((HT_GPIOx->LOCKR & GPIO_PIN_n) == 0)
    result = FALSE;
  else
    result = TRUE;
  GPIO_CK_OFF();
  return result;
}

#if (LIBCFG_GPIO_DISABLE_DEBUG_PORT)
/*********************************************************************************************************//**
 * @brief  Disable DEBUG port to prevent unexpected security lock.
 * @retval None
 ************************************************************************************************************/
void GPIO_DisableDebugPort(void)
{
  CKCU_PeripClockConfig_TypeDef CKCUClock = {{ 0 }};
  CKCUClock.Bit.PA         = 1;
  CKCUClock.Bit.AFIO       = 1;
  CKCU_PeripClockConfig(CKCUClock, ENABLE);

  AFIO_GPxConfig(GPIO_PA, GPIO_PIN_13, AFIO_FUN_GPIO);
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_13, GPIO_PR_DOWN);

  #if 0
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_12, GPIO_PR_DOWN);
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_12, GPIO_PR_UP);
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_12, GPIO_PR_DOWN);
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_12, GPIO_PR_UP);
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_12, GPIO_PR_DOWN);
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_12, GPIO_PR_UP);
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_12, GPIO_PR_DOWN);
  GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_12, GPIO_PR_UP);
  AFIO_GPxConfig(GPIO_PA, GPIO_PIN_12, AFIO_FUN_GPIO);
  #endif
}
#endif

/*********************************************************************************************************//**
 * @brief Convert HT_GPIOx to GPIO_Px
 * @param HT_GPIOx: where HT_GPIOx is the selected GPIO from the GPIO peripherals.
 * @retval GPIO_Px: GPIO ID
 ************************************************************************************************************/
u32 GPIO_GetID(HT_GPIO_TypeDef* HT_GPIOx)
{
  // Convert 0x400B0000 ~ 0x400C6000 to 0 ~ 11
  u32 GPIO_Px = (((u32)HT_GPIOx) >> (12 + 1)) & 0x7F;
  GPIO_Px -= 0x58;  // 0xB0000 >> 13 = 0x58

  return GPIO_Px;
}

/*********************************************************************************************************//**
 * @brief Deinitialize the AFIO peripheral registers to their default reset values.
 * @retval None
 ************************************************************************************************************/
void AFIO_DeInit(void)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};

  RSTCUReset.Bit.AFIO = 1;
  RSTCU_PeripReset(RSTCUReset, ENABLE);
}

/*********************************************************************************************************//**
 * @brief Configure alternated mode of GPIO with specified pins.
 * @param GPIO_Px: GPIO_PA ~ GPIO_PD.
 * @param AFIO_PIN_n: This parameter can be any combination of AFIO_PIN_x.
 * @param AFIO_MODE_n: This parameter can be one of the following values:
 *        @arg AFIO_MODE_DEFAULT : The default I/O function
 *        @arg AFIO_MODE_1       : Alternated mode 1
 *        @arg AFIO_MODE_2       : Alternated mode 2
 *        @arg AFIO_MODE_3       : Alternated mode 3
 *        @arg AFIO_MODE_4       : Alternated mode 4
 *        @arg AFIO_MODE_5       : Alternated mode 5
 *        @arg AFIO_MODE_6       : Alternated mode 6
 *        @arg AFIO_MODE_7       : Alternated mode 7
 *        @arg AFIO_MODE_8       : Alternated mode 8
 *        @arg AFIO_MODE_9       : Alternated mode 9
 *        @arg AFIO_MODE_10      : Alternated mode 10
 *        @arg AFIO_MODE_11      : Alternated mode 11
 *        @arg AFIO_MODE_12      : Alternated mode 12
 *        @arg AFIO_MODE_13      : Alternated mode 13
 *        @arg AFIO_MODE_14      : Alternated mode 14
 *        @arg AFIO_MODE_15      : Alternated mode 15
 * @retval None
 ************************************************************************************************************/
void AFIO_GPxConfig(u32 GPIO_Px, u32 AFIO_PIN_n, AFIO_MODE_Enum AFIO_MODE_n)
{
  #if (HT32_LIB_LITE == 0)
  vu32* pGPxCFGR = ((vu32*)&HT_AFIO->GPACFGR[0]) + GPIO_Px * 2;
  u32 i = 2;
  AFIO_CK_ST;

  Assert_Param(IS_AFIO_MODE(AFIO_MODE_n));
  AFIO_CK_ON();

  do
  {
    u32 pins = AFIO_PIN_n & 0xFF;
    u32 index = 0;
    if (pins)
    {
      u32 Mask = 0, PinMode = 0;
      do
      {
        if (pins & 1)
        {
          Mask |= (0xF << index);
          PinMode |= (AFIO_MODE_n << index);
        }
        index += 4;
      } while (pins >>= 1);
      *pGPxCFGR = (*pGPxCFGR & (~Mask)) | PinMode;
    }
    pGPxCFGR++;
  } while ((AFIO_PIN_n >>= 8) && --i);

  AFIO_CK_OFF();
  #else
  u32 pin_idx = 0;
  u32 reg_idx;
  u32 shift;

  Assert_Param(IS_AFIO_MODE(AFIO_MODE_n));

  while (AFIO_PIN_n >>= 1)
  {
    pin_idx++;
  }
  
  reg_idx = (GPIO_Px << 1) + (pin_idx >> 3);
  shift = (pin_idx & 0x07) << 2;  
  
  HT_AFIO->GPACFGR[reg_idx] = (HT_AFIO->GPACFGR[reg_idx] & ~(0xF << shift)) | (AFIO_MODE_n << shift);
  #endif
}

/*********************************************************************************************************//**
 * @brief Select the GPIO pin to be used as EXTI channel.
 * @param GPIO_PIN_NUM_n: Specify the GPIO pin number to be configured.
 * @param GPIO_Px: GPIO_PA ~ GPIO_PF.
 * @retval None
 ************************************************************************************************************/
void AFIO_EXTISourceConfig(u32 GPIO_PIN_NUM_n, u32 GPIO_Px)
{
  u8 index = 0;
  u32 tmp = 0;
  AFIO_CK_ST;

